---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RenderRpcProperties
source: html/22c5fcdf-be6d-68cd-3251-d69ef4d5b92e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RenderRpcProperties Property

"Render Appearance Properties"

## Syntax (C#)
```csharp
public static ForgeTypeId RenderRpcProperties { get; }
```